# missing data

In [2]:
import pandas as pd
import numpy as np
from numpy import nan as NA

###### pandas.isnull(obj)[source]

In [3]:
string_data = pd.Series(["apple", "strawberry", np.nan, "avocado",None])
string_data

0         apple
1    strawberry
2           NaN
3       avocado
4          None
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [5]:
string_data.isnull().any()

True

In [6]:
#None also act as NaN value
string_data[0] = None

In [7]:
string_data

0          None
1    strawberry
2           NaN
3       avocado
4          None
dtype: object

In [8]:
string_data.isna()  #also involve

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [9]:
string_data.isnull().sum()    #calculate total number of nan values

3

In [10]:
#True is equal to 1
#False is equal to 0
#so in isnull().sum() True values add and give number

In [11]:
string_data[string_data.isnull()]

0    None
2     NaN
4    None
dtype: object

## dropna

### for series

In [13]:
string_data.dropna?

In [8]:
data = pd.Series([1,3.5,NA,NA,NA,NA,9])
data

0    1.0
1    3.5
2    NaN
3    NaN
4    NaN
5    NaN
6    9.0
dtype: float64

In [9]:
data.dropna()

0    1.0
1    3.5
6    9.0
dtype: float64

In [10]:
data[data.isnull()]

2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
1    3.5
6    9.0
dtype: float64

### for dataframes

###### DataFrame.dropna(self, axis=0, how='any', thresh=None, subset=None, inplace=False)[source]

In [14]:
data1 = pd.DataFrame([[1,2,3,4],[5,6,NA,NA],[7,8,9,None],[NA,NA,NA,NA]])

In [15]:
data1

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  6.0  NaN  NaN
2  7.0  8.0  9.0  NaN
3  NaN  NaN  NaN  NaN

In [16]:
cleaned = data1.dropna()  #dropna by default drpos all rows containing any nan value

In [17]:
cleaned

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [18]:
cleaned = data1.dropna(how="all")  #passing how="all" drops only that row which contain all nan values
cleaned

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  6.0  NaN  NaN
2  7.0  8.0  9.0  NaN

In [19]:
#same we can do for columnn
data1[4] = np.nan

In [20]:
data1

     0    1    2    3   4
0  1.0  2.0  3.0  4.0 NaN
1  5.0  6.0  NaN  NaN NaN
2  7.0  8.0  9.0  NaN NaN
3  NaN  NaN  NaN  NaN NaN

In [21]:
data1.dropna(how="all",axis=1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  5.0  6.0  NaN  NaN
2  7.0  8.0  9.0  NaN
3  NaN  NaN  NaN  NaN

In [22]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  1.472053  0.649905  1.249034
1  0.398568  1.633402 -2.192846
2 -0.908175 -0.034914  0.886035
3  0.700255 -0.250596 -1.401483
4  0.103724 -0.144921 -0.245901
5  0.615317  0.615817  0.511679
6 -0.671434  0.450258  0.044376

In [23]:
df.iloc[:4,1]=NA

In [24]:
df.iloc[:2,2] = NA

In [25]:
df

          0         1         2
0  1.472053       NaN       NaN
1  0.398568       NaN       NaN
2 -0.908175       NaN  0.886035
3  0.700255       NaN -1.401483
4  0.103724 -0.144921 -0.245901
5  0.615317  0.615817  0.511679
6 -0.671434  0.450258  0.044376

In [26]:
df.dropna()

          0         1         2
4  0.103724 -0.144921 -0.245901
5  0.615317  0.615817  0.511679
6 -0.671434  0.450258  0.044376

In [27]:
df.dropna(thresh=2)

          0         1         2
2 -0.908175       NaN  0.886035
3  0.700255       NaN -1.401483
4  0.103724 -0.144921 -0.245901
5  0.615317  0.615817  0.511679
6 -0.671434  0.450258  0.044376

In [28]:
d = pd.DataFrame([[1,2,3],[4,np.nan,5],[7,8,np.nan]])    #nan is a float

In [27]:
d

   0    1    2
0  1  2.0  3.0
1  4  NaN  5.0
2  7  8.0  NaN

In [30]:
d.dropna(subset=[1])   #drop with respect to particular/given column

   0    1    2
0  1  2.0  3.0
2  7  8.0  NaN

In [32]:
d.dropna()

   0    1    2
0  1  2.0  3.0

# filling in missing data

##### df.fillna(value,axis,method,inplace,limit)

In [28]:
df.fillna(0)

          0         1         2
0  0.518871  0.000000  0.000000
1 -0.347973  0.000000  0.000000
2  1.528061  0.000000 -1.117569
3  0.460502  0.000000 -1.394264
4  0.427551  0.291313  0.333452
5  2.253619  0.189895  0.373871
6 -0.460804  1.842668 -1.523544

In [29]:
df.fillna({1:0.5,2:1})

          0         1         2
0  0.518871  0.500000  1.000000
1 -0.347973  0.500000  1.000000
2  1.528061  0.500000 -1.117569
3  0.460502  0.500000 -1.394264
4  0.427551  0.291313  0.333452
5  2.253619  0.189895  0.373871
6 -0.460804  1.842668 -1.523544

In [30]:
df1 = pd.DataFrame(np.random.randn(6,3))
df1

          0         1         2
0  0.280621  0.204457 -0.228027
1 -0.235678 -1.854827  0.354253
2  0.317428 -0.600195 -0.291772
3 -0.212473 -0.260268  1.192009
4 -0.790675 -0.067762 -1.403257
5  0.874409  0.317695 -0.869911

In [31]:
df1.iloc[2:,1] = NA
df1.iloc[4:,2] = NA

In [32]:
df1

          0         1         2
0  0.280621  0.204457 -0.228027
1 -0.235678 -1.854827  0.354253
2  0.317428       NaN -0.291772
3 -0.212473       NaN  1.192009
4 -0.790675       NaN       NaN
5  0.874409       NaN       NaN

In [33]:
df1.fillna(method="ffill")

          0         1         2
0  0.280621  0.204457 -0.228027
1 -0.235678 -1.854827  0.354253
2  0.317428 -1.854827 -0.291772
3 -0.212473 -1.854827  1.192009
4 -0.790675 -1.854827  1.192009
5  0.874409 -1.854827  1.192009

In [34]:
df1.fillna(method="pad")  #pad same as ffill

          0         1         2
0  0.280621  0.204457 -0.228027
1 -0.235678 -1.854827  0.354253
2  0.317428 -1.854827 -0.291772
3 -0.212473 -1.854827  1.192009
4 -0.790675 -1.854827  1.192009
5  0.874409 -1.854827  1.192009

In [35]:
df1.fillna(method="ffill",limit=3)

          0         1         2
0  0.280621  0.204457 -0.228027
1 -0.235678 -1.854827  0.354253
2  0.317428 -1.854827 -0.291772
3 -0.212473 -1.854827  1.192009
4 -0.790675 -1.854827  1.192009
5  0.874409       NaN  1.192009

In [36]:
fn = pd.DataFrame(np.random.randn(7,3))
fn

          0         1         2
0  0.001495  1.421752  0.597211
1  0.813890 -0.217762 -0.496678
2 -0.565647 -0.192044 -0.933902
3  0.497892 -1.964507  2.016651
4  0.372519 -1.855140  1.883687
5  1.138820 -1.041362 -0.146669
6 -1.385440 -0.429808 -0.083559

In [37]:
fn.iloc[:4,1] = NA
fn.iloc[:3,2] = NA

In [38]:
fn

          0         1         2
0  0.001495       NaN       NaN
1  0.813890       NaN       NaN
2 -0.565647       NaN       NaN
3  0.497892       NaN  2.016651
4  0.372519 -1.855140  1.883687
5  1.138820 -1.041362 -0.146669
6 -1.385440 -0.429808 -0.083559

In [39]:
fn.fillna(method="backfill")  #backfill and bfill are same

          0         1         2
0  0.001495 -1.855140  2.016651
1  0.813890 -1.855140  2.016651
2 -0.565647 -1.855140  2.016651
3  0.497892 -1.855140  2.016651
4  0.372519 -1.855140  1.883687
5  1.138820 -1.041362 -0.146669
6 -1.385440 -0.429808 -0.083559